#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.main: Refreshing state... [id=fe840115403679664580ce9fe9ef34a0bfc16954]
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1lOWUyYTQzMC0xMGY0LTRjMDYtOWM0NC05NGMzNTZkZWU4ZjU7b2JqZWN0SWQ9YzhmZTE5ZjEtY2Y2Ni00OTdkLWFjZDItM2EyY2RiNmM1MGQ1O3N1YnNjcmlwdGlvbklkPTFjOGEyNzE4LWM3MjAtNDAyYy1hOTEyLTMwMmE4ODQ2NjM5Zjt0ZW5hbnRJZD1mMzA2MzkyMS1jYTk1LTQxYTgtOTEwNC1jYTUwMGQwOTZhYTY=]
data.azurerm_resource_group.example: Read complete after 1s [id=/subscriptions/1c8a2718-c720-402c-a912-302a8846639f/resourceGroups/raryda-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/1c8a2718-c720-402c-a912-302a8846639f/resourceGroups/raryda-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/1c8a2718-c720-402c-a912-302a8846639f/resourceGroups/raryda-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/1c8a2718-c720-402c-a912-302a8846639f/resourceGroups/raryda-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/1c8a2718-c720-402c-a912-302a8846639f/resourceGroups/raryda-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/1c8a2718-c720-402c-a912-302a8846639f/resourceGroups/raryda-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      - tags                            = {} -> null
      ~ virtual_machine_id              = "56f4ff94-01ae-4356-861b-ef94663fa0c8" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (26 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb                     = 30 -> (known after apply)
          ~ name                             = "example-machine_OsDisk_1_c2d0730471de479e972f13ae6dad4fb8" -> (known after apply)
            # (6 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @RARYates, Action: `pull_request`*